# Настройка {#setup}

Основной способ работы с Git --- это команда `git`, которую мы выполнили в предыдущей главе.
Команды для терминала вы встретите в документации и в интернете, ими легко поделиться и использовать в скриптах.
Кроме терминала есть много других способов и их даже можно использовать одновременно.

Графические интерфейсы --- все они имеют ограничения и реализуют только часть возможностей Git, но достаточны для решения большинства задач. Это может быть интерфейс, встроенный в другие программы (например [RStudio](https://docs.posit.co/ide/user/ide/guide/tools/version-control.html), [Pycharm](https://www.jetbrains.com/help/pycharm/using-git-integration.html), [VS Code](https://code.visualstudio.com/docs/sourcecontrol/overview)) или самостоятельная программа (например [GitHub Desktop](https://github.com/apps/desktop), [GitKraken](https://www.gitkraken.com) [и многие другие](https://git-scm.com/downloads/guis));

Веб-интерфейсы --- прямо на сайте GitHub можно редактировать отдельные файлы, а также выполнять некоторые команды.

В этом курсе мы будем работать с Git одновременно в интерфейсе RStudio и в терминале, как это делает большинство пользователей R каждый день, а также через GitHub.
Поэтому запомните, как запустить терминал в RStudio ---
в верхнем меню выберите **Tools → Terminal → New Terminal** ([см. скриншот в предыдущей главе](#terminal)).

Перед началом работы необходимо сделать несколько настроек.
Укажите свое имя и адрес электронной почты, чтобы Git верно записывал информацию об авторе изменений.
В терминале выполните следующие команды, заменив **Your Name** на свое имя и **your@email.com** на свой email, не стирая кавычки.

```sh
git config --global user.name "Your Name"
git config --global user.email "your@email.com"
```

Если вы уже использовали Git, то чтобы вывести в терминале текущее значение настроек выполните эти же команды, но не указывая новых значений.

```sh
git config --global user.name
git config --global user.email
```

Также заранее настроим способ объединения изменений, чтобы не возвращаться к этому позже.

```sh
git config --global pull.rebase false
```

Опция `--global` означает, что эти настройки будут использованы для всех проектов на компьютере и их достаточно сделать один раз.
Чтобы изменить настройки для отдельного проекта, выполните в нем эти же команды без опции `--global`. Например, иногда требуется указать корпоративный email для рабочего проекта на персональном компьютере.

Это все настройки, которые понадобятся для курса.
Всего через команду `git config` их доступно более 800.
